import React from 'react';
import styles from './index.scss';

import Image from '../../components/image/';

class About extends React.Component {
  constructor(props) {
    super(props);
  }
  render() {
    return (
      <div className={styles.about}>
        <h1>ABOUT</h1>
        <p className={styles.text}>我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。</p>
        <p className={styles.text}>Hello darkness my old friend Hello darkness my old friend Hello darkness my old friend Hello darkness my old friend Hello darkness my old friend Hello darkness my old friend Hello darkness my old friend Hello darkness my old friend Hello darkness my old friend Hello darkness my old friend</p>
        <p className={styles.text}>我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。</p>
        <Image imgSrc="home.jpg"/>
        <p className={styles.text}>我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。</p>

        <p className={styles.text}>我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。</p>

        <p className={styles.text}>我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。</p>

        <p className={styles.text}>我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。我常常想，重逢时。怎么止住泪水的悲伤，怎么化解无言的尴尬。只是，远方终究没有故人的消息。</p>
      </div>
    );
  }
}

export default About;
